//Запросити у користувача рік народження.
//Запитати в нього, в якому місті він живе.
//Запитати його улюблений вид спорту.

//При натисканні на ОК показуємо вікно, 
// де має бути відображена наступна інформація:

//Його вік.
// Якщо користувач запровадить Київ, Вашингтон чи Лондон,
//  то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну,
//  столицю якої він запровадив. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.

//Вибираємо самі три види спорту та три чемпіони у цих видах.
// Відповідно, якщо користувач запровадить один із цих видів спорту,
// то показуємо йому повідомлення “Круто! Хочеш стати…” і підставляємо на місце точок ім'я та прізвище чемпіона.
 

//Все це має бути відображено в одному вікні (алерті).
// Якщо в якомусь випадку він не захоче вводити
// інформацію і натисне Скасувати, показати йому повідомлення 
// - "Шкода, що Ви не захотіли ввести свій(ю) ..." і вказуємо, що він не захотів вводити - дату народження, місто або вид спорту.


let year = prompt('Введіть Ваш рік народження', '1990');
let city = prompt('Введіть місто, в якому ви живете', 'Київ');
let sport = prompt('Введіть Ваш улюблений вид спорту', 'Футбол');

let capitalCities = { Київ: 'України', Вашингтон: 'США', Лондон: 'Великобританії' };
let sportsChampions = { Футбол: 'Мессі', Баскетбол: 'Джордан', Бокс: 'Тайсон' };

let messages = [];
//пусті введення
if (!year) messages.push('Шкода, що Ви не захотіли ввести свій рік народження.');
if (!city) messages.push('Шкода, що Ви не захотіли ввести своє місто.');
if (!sport) messages.push('Шкода, що Ви не захотіли ввести свій улюблений вид спорту.');

//повідомлення якщо інформація введена
if (year) messages.push(`Ваш рік народження: ${year}.`);
if (city) {
    if (capitalCities[city]) {
        messages.push(`Ви живете у столиці ${capitalCities[city]}.`);
    } else {
        messages.push(`Ви живете у місті ${city}.`);
    }
}
if (sport) {
    if (sportsChampions[sport]) {
        messages.push(`Круто! Хочете стати як ${sportsChampions[sport]}!`);
    } else {
        messages.push(`Ваш улюблений вид спорту - ${sport}.`);
    }
}

//виведення повідомлень
alert(messages.join('\n'));
